'''
Даны имена и средняя успеваемость учеников класса. Необходимо вывести имена одного или нескольких учеников, находящихся на предпоследнем месте по успеваемости.
Формат входных данных.
Набор студентов представлен списком длиной N, то есть количество учеников в классе, каждый элемент которого представлен в виде вложенного списка из двух элементов: Имя, оценка.
Например:
students = [ [Петя, 4.5], [Вася, 4.3], [Коля, 3.5], [Никита, 4.8], [Катя, 4.3] ]
Формат выходных данных.
Вывести только имена учеников, чьи оценки предпоследние с конца.
Вернемся к примеру
Наименьшая оценка из учеников 3.5, следующая по возрастанию 4.3. Присутствуют два ученика с такой оценкой: Вася и Катя.
'''
